qmk/qmk_firmware/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_Maxim/TARGET_MAX32600/max32600.h
#define MXC_TMR_GET_BASE(i)              ((i) == 0 ? MXC_BASE_TMR0 : \
                                          (i) == 1 ? MXC_BASE_TMR1 : \
                                          (i) == 2 ? MXC_BASE_TMR2 : \
                                          (i) == 3 ? MXC_BASE_TMR3 : 0)

#define MXC_TMR_GET_TMR(i)               ((i) == 0 ? MXC_TMR0 : \
                                          (i) == 1 ? MXC_TMR1 : \
                                          (i) == 2 ? MXC_TMR2 : \
                                          (i) == 3 ? MXC_TMR3 : 0)
/*******************************************************************************/
/*                                                              Watchdog Timer */

#define MXC_CFG_WDT_INSTANCES            (2)

#define MXC_BASE_WDT0                    ((uint32_t)0x40021000UL)
#define MXC_BASE_WDT0_BITBAND            ((uint32_t)0x42420000UL)
#define MXC_WDT0                         ((mxc_wdt_regs_t *)MXC_BASE_WDT0)

#define MXC_BASE_WDT1                    ((uint32_t)0x40022000UL)
#define MXC_BASE_WDT1_BITBAND            ((uint32_t)0x42440000UL)
#define MXC_WDT1                         ((mxc_wdt_regs_t *)MXC_BASE_WDT1)

#define MXC_WDT_GET_IRQ(i)               ((i) == 0 ? WDT0_IRQn : \
                                          (i) == 1 ? WDT1_IRQn : 0)

#define MXC_WDT_GET_IRQ_P(i)             ((i) == 0 ? WDT0_P_IRQn : \
                                          (i) == 1 ? WDT1_P_IRQn : 0)

#define MXC_WDT_GET_BASE(i)              ((i) == 0 ? MXC_BASE_WDT0 : \
                                          (i) == 1 ? MXC_BASE_WDT1 : 0)

#define MXC_WDT_GET_WDT(i)               ((i) == 0 ? MXC_WDT0 : \
                                          (i) == 1 ? MXC_WDT1 : 0)

/*******************************************************************************/
/*                                                               SPI Interface */

#define MXC_CFG_SPI_INSTANCES            (3)
#define MXC_CFG_SPI_FIFO_DEPTH           (16)

#define MXC_BASE_SPI0                    ((uint32_t)0x40030000UL)
#define MXC_SPI0                         ((mxc_spi_regs_t *)MXC_BASE_SPI0)

#define MXC_BASE_SPI0_TXFIFO             ((uint32_t)0x40100000UL)
#define MXC_SPI0_TXFIFO                  ((mxc_spi_txfifo_regs_t *)MXC_BASE_SPI0_TXFIFO)
#define MXC_BASE_SPI0_RXFIFO             ((uint32_t)0x40100800UL)
#define MXC_SPI0_RXFIFO                  ((mxc_spi_rxfifo_regs_t *)MXC_BASE_SPI0_RXFIFO)

#define MXC_BASE_SPI1                    ((uint32_t)0x40031000UL)
#define MXC_SPI1                         ((mxc_spi_regs_t *)MXC_BASE_SPI1)

#define MXC_BASE_SPI1_TXFIFO             ((uint32_t)0x40101000UL)
#define MXC_SPI1_TXFIFO                  ((mxc_spi_txfifo_regs_t *)MXC_BASE_SPI1_TXFIFO)
#define MXC_BASE_SPI1_RXFIFO             ((uint32_t)0x40101800UL)
#define MXC_SPI1_RXFIFO                  ((mxc_spi_rxfifo_regs_t *)MXC_BASE_SPI1_RXFIFO)

#define MXC_BASE_SPI2                    ((uint32_t)0x40032000UL)
#define MXC_SPI2                         ((mxc_spi_regs_t *)MXC_BASE_SPI2)

#define MXC_BASE_SPI2_TXFIFO             ((uint32_t)0x40102000UL)
#define MXC_SPI2_TXFIFO                  ((mxc_spi_txfifo_regs_t *)MXC_BASE_SPI2_TXFIFO)
#define MXC_BASE_SPI2_RXFIFO             ((uint32_t)0x40102800UL)
#define MXC_SPI2_RXFIFO                  ((mxc_spi_rxfifo_regs_t *)MXC_BASE_SPI2_RXFIFO)


#define MXC_SPI_GET_IRQ(i)               ((i) == 0 ? SPI0_IRQn :       \
                                          (i) == 1 ? SPI1_IRQn :       \
                                          (i) == 2 ? SPI2_IRQn : 0)

#define MXC_SPI_GET_BASE(i)              ((i) == 0 ? MXC_BASE_SPI0 :      \
                                          (i) == 1 ? MXC_BASE_SPI1 :      \
                                          (i) == 2 ? MXC_BASE_SPI2 : 0)

#define MXC_SPI_GET_SPI(i)               ((i) == 0 ? MXC_SPI0 :      \
                                          (i) == 1 ? MXC_SPI1 :      \
                                          (i) == 2 ? MXC_SPI2 : 0)

#define MXC_SPI_GET_RXFIFO(i)            ((i) == 0 ? MXC_SPI0_RXFIFO :      \
                                          (i) == 1 ? MXC_SPI1_RXFIFO :      \
                                          (i) == 2 ? MXC_SPI2_RXFIFO : 0)

#define MXC_SPI_GET_TXFIFO(i)            ((i) == 0 ? MXC_SPI0_TXFIFO :      \
                                          (i) == 1 ? MXC_SPI1_TXFIFO :      \
                                          (i) == 2 ? MXC_SPI2_TXFIFO : 0)

#define MXC_SPI_INSTANCE_TO_BASE(instance) (((uint32_t)(instance) << 12) + MXC_BASE_SPI0)
#define MXC_SPI_BASE_TO_INSTANCE(base)     (((uint32_t)(base) & 0x00003000) >> 12)


/*******************************************************************************/
/*                                                              UART Interface */

#define MXC_CFG_UART_INSTANCES           (2)

#define MXC_BASE_UART0                   ((uint32_t)0x40038000UL)
#define MXC_BASE_UART0_BITBAND           ((uint32_t)0x42700000UL)
#define MXC_UART0                        ((mxc_uart_regs_t *)MXC_BASE_UART0)

#define MXC_BASE_UART1                   ((uint32_t)0x40039000UL)
#define MXC_BASE_UART1_BITBAND           ((uint32_t)0x42720000UL)
#define MXC_UART1                        ((mxc_uart_regs_t *)MXC_BASE_UART1)


#define MXC_UART_GET_IRQ(i)              ((i) == 0 ? UART0_IRQn :      \
                                          (i) == 1 ? UART1_IRQn : 0)

#define MXC_UART_GET_BASE(i)             ((i) == 0 ? MXC_BASE_UART0 :     \
                                          (i) == 1 ? MXC_BASE_UART1 : 0)

#define MXC_UART_GET_UART(i)             ((i) == 0 ? MXC_UART0 :     \
                                          (i) == 1 ? MXC_UART1 : 0)

#define MXC_UART_INSTANCE_TO_BASE(instance) (((uint32_t)(instance) << 12) + MXC_BASE_UART0)
#define MXC_UART_BASE_TO_INSTANCE(base)     (((uint32_t)(base) & 0x00001000) >> 12)


/*******************************************************************************/
/*                                                        I2C Master Interface */

#define MXC_CFG_I2CM_INSTANCES           (2)

