qmk/qmk_firmware/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_Maxim/TARGET_MAX32600/max32600.h
/*******************************************************************************/
/*                                                                         LCD */
#define MXC_BASE_LCD                     ((uint32_t)0x40060000)
#define MXC_LCD                          ((mxc_lcd_regs_t *)MXC_BASE_LCD)

/*******************************************************************************/
/*                  Peripheral Management Unit (PMU) - formerly DMA Controller */

#define MXC_CFG_PMU_CHANNELS             (6)

#define MXC_BASE_PMU0                    ((uint32_t)0x40070000UL)
#define MXC_PMU0                         ((mxc_pmu_regs_t *)MXC_BASE_PMU0)
#define MXC_BASE_PMU1                    ((uint32_t)0x40070020UL)
#define MXC_PMU1                         ((mxc_pmu_regs_t *)MXC_BASE_PMU1)
#define MXC_BASE_PMU2                    ((uint32_t)0x40070040UL)
#define MXC_PMU2                         ((mxc_pmu_regs_t *)MXC_BASE_PMU2)
#define MXC_BASE_PMU3                    ((uint32_t)0x40070060UL)
#define MXC_PMU3                         ((mxc_pmu_regs_t *)MXC_BASE_PMU3)
#define MXC_BASE_PMU4                    ((uint32_t)0x40070080UL)
#define MXC_PMU4                         ((mxc_pmu_regs_t *)MXC_BASE_PMU4)
#define MXC_BASE_PMU5                    ((uint32_t)0x400700A0UL)
#define MXC_PMU5                         ((mxc_pmu_regs_t *)MXC_BASE_PMU5)

#define MXC_BASE_PMU_BITBAND            ((uint32_t)0x42E00000UL)
#define MXC_BASE_PMU_BITBAND_CHOFFSET   ((uint32_t)0x00000400UL)
/*******************************************************************************/

typedef enum {
    PMU_IRQ_DAC0_FIFO_AE,
    PMU_IRQ_DAC1_FIFO_AE,
    PMU_IRQ_DAC2_FIFO_AE,
    PMU_IRQ_DAC3_FIFO_AE,
    PMU_IRQ_DAC0_DONE,
    PMU_IRQ_DAC1_DONE,
    PMU_IRQ_DAC2_DONE,
    PMU_IRQ_DAC3_DONE,
    PMU_IRQ_ADC_FIFO_AF,
    PMU_IRQ_ADC_DONE,
    PMU_IRQ_I2C_MST0_DONE,
    PMU_IRQ_I2C_MST1_DONE,
    PMU_IRQ_SPI0_RSLTS_DONE,
    PMU_IRQ_SPI1_RSLTS_DONE,
    PMU_IRQ_SPI2_RSLTS_DONE,
    PMU_IRQ_MAA_DONE,
    PMU_IRQ_SPI0_TX_FIFO_AE,
    PMU_IRQ_SPI0_RSLTS_FIFO_AF,
    PMU_IRQ_SPI1_TX_FIFO_AE,
    PMU_IRQ_SPI1_RSLTS_FIFO_AF,
    PMU_IRQ_SPI2_TX_FIFO_AE,
    PMU_IRQ_SPI3_RSLTS_FIFO_AF,
    PMU_IRQ_I2C_MST0_TRANS_FIFO,
    PMU_IRQ_I2C_MST0_RSLT_FIFO,
    PMU_IRQ_I2C_MST1_TRANS_FIFO,
    PMU_IRQ_I2C_MST2_RSLT_FIFO,
    PMU_IRQ_I2C_SLV_TRANS_FIFO,
    PMU_IRQ_I2C_SLV_RSLT_FIFO,
    PMU_IRQ_UART0_TX_FIFO,
    PMU_IRQ_UART0_RX_FIFO,
    PMU_IRQ_UART1_TX_FIFO,
    PMU_IRQ_UART1_RX_FIFO,
    PMU_IRQ_SPI0_EXCP,
    PMU_IRQ_SPI1_EXCP,
    PMU_IRQ_SPI2_EXCP,
    PMU_IRQ_RSVD0,
    PMU_IRQ_I2C_MST0_EXCP,
    PMU_IRQ_I2C_MST1_EXCP,
    PMU_IRQ_I2C_SLV_EXCP,
    PMU_IRQ_RSVD1,
    PMU_IRQ_GPIO0,
    PMU_IRQ_GPIO1,
    PMU_IRQ_GPIO2,
    PMU_IRQ_GPIO3,
    PMU_IRQ_GPIO4,
    PMU_IRQ_GPIO5,
    PMU_IRQ_GPIO6,
    PMU_IRQ_GPIO7,
    PMU_IRQ_GPIO8,
    PMU_IRQ_AFE_COMP_NMI,
    PMU_IRQ_AES_ENGINE,
} pmu_int_mask_t;

/*******************************************************************************/
/*                                                                         USB */

#define MXC_BASE_USB                     ((uint32_t)0x4010C000UL)
#define MXC_USB                          ((mxc_usb_regs_t *)MXC_BASE_USB)

#define MXC_USB_MAX_PACKET               (64)
#define MXC_USB_NUM_EP                   (8)


/*******************************************************************************/
/*                                                Instruction Cache Controller */

#define MXC_BASE_ICC                     ((uint32_t)0x40080000UL)
#define MXC_ICC                          ((mxc_icc_regs_t *)MXC_BASE_ICC)

/*                                                              System Manager */

#define MXC_BASE_SYSMAN                 ((uint32_t)0x40090000UL)

/*******************************************************************************/
/*                                                               Clock Manager */

#define MXC_BASE_CLKMAN                  ((uint32_t)0x40090400UL)
#define MXC_CLKMAN                       ((mxc_clkman_regs_t *)MXC_BASE_CLKMAN)


/*******************************************************************************/
/*                                                               Power Manager */

#define MXC_BASE_PWRMAN                  ((uint32_t)0x40090800UL)
#define MXC_PWRMAN                       ((mxc_pwrman_regs_t *)MXC_BASE_PWRMAN)

/*******************************************************************************/
/*                                                                 I/O Manager */

#define MXC_BASE_IOMAN                   ((uint32_t)0x40090C00UL)
#define MXC_IOMAN                        ((mxc_ioman_regs_t *)MXC_BASE_IOMAN)


/*******************************************************************************/
/*                                                           RTC: Timer/Alarms */

#define MXC_BASE_RTCTMR                 ((uint32_t)0x40090A00UL)
#define MXC_RTCTMR                       ((mxc_rtctmr_regs_t *)MXC_BASE_RTCTMR)

#define MXC_RTCTMR_GET_IRQ(i) (i == 0 ? RTC0_IRQn :    \
                               i == 1 ? RTC1_IRQn :    \
                               i == 2 ? RTC2_IRQn :    \
                               i == 3 ? RTC3_IRQn : 0)

#define MXC_BASE_RTCCFG                  ((uint32_t)0x40090A70UL)
#define MXC_RTCCFG                       ((mxc_rtccfg_regs_t *)MXC_BASE_RTCCFG)
/*******************************************************************************/
/*                                                        RTC: Power Sequencer */

#define MXC_BASE_PWRSEQ                  ((uint32_t)0x40090A30UL)
#define MXC_PWRSEQ                       ((mxc_pwrseq_regs_t *)MXC_BASE_PWRSEQ)

/*******************************************************************************/
/*                                                       Trim Shadow Registers */

#define MXC_BASE_TRIM                    ((uint32_t)0x400E0000UL)
#define MXC_TRIM                         ((mxc_ftr_regs_t *)MXC_BASE_TRIM)

/*******************************************************************************/
/*                                          Flash Memory Controller / Security */

#define MXC_BASE_FLC                     ((uint32_t)0x400F0000UL)
#define MXC_FLC                          ((mxc_flc_regs_t *)MXC_BASE_FLC)
#define MXC_BASE_FLC_BITBAND             ((uint32_t)0x43E00000UL)
#define MXC_FLC_PAGE_SIZE_SHIFT          11
#define MXC_FLC_PAGE_SIZE                (1 << MXC_FLC_PAGE_SIZE_SHIFT)
#define MXC_FLC_PAGE_ERASE_MSK           ((~(1 << (MXC_FLC_PAGE_SIZE_SHIFT - 1))) >> MXC_FLC_PAGE_SIZE_SHIFT) << MXC_FLC_PAGE_SIZE_SHIFT

/*******************************************************************************/

#define MXC_SET_FIELD(reg, clr, set) (*(volatile uint32_t *)reg = ((*(volatile uint32_t *)reg & ~clr) | set))

/*******************************************************************************/

#define BITBAND(reg, bit)        ((0xf0000000 & (uint32_t)(reg)) + 0x2000000 + (((uint32_t)(reg) & 0x0fffffff) << 5) + ((bit) << 2))
#define BITBAND_ClrBit(reg, bit) *(volatile uint32_t *)BITBAND(reg, bit) = 0
#define BITBAND_SetBit(reg, bit) *(volatile uint32_t *)BITBAND(reg, bit) = 1
#define BITBAND_GetBit(reg, bit) (*(volatile uint32_t *)BITBAND(reg, bit))

/*******************************************************************************/

#endif  /* _MAX32600_H_ */
